<h2>Список основных функций программы Holyrics</h2>

<h3>Проекция</h3>
Программа Holyrics — это проекционное программное обеспечение, отображающее и управляющее презентациями на дополнительном экране системы, а также на других экранах для представления дополнительной информации.<br>
<br>
Поддерживаются:<br>
<ul>
  <li>Тексты песен.</li>
  <li>Библейские стихи.</li>
  <li>Произвольные тексты.</li>
  <li>Изображения, аудио и видео.</li>
  <li>Обратный отсчет.</li>
  <li>Предупреждения бегущей строкой (внизу или вверху проекционного экрана).</li>
  <li>Текст на мониторе сцены.</li>
  <li>Обратный отсчет или таймер на мониторе сцены.</li>
  <li>Оповещения на мониторе сцены.</li>
</ul>

<hr />

<h3>Независимость между контентом и макетом</h3>
Holyrics работает независимо между набранным текстом, который будет отображаться на экране, и форматированием, макетом и фоном, которые будут использоваться для отображения этого контента на экране.<br>
При вводе или выборе текста, на экране всегда будет применена связанная тема для отображения этого контента с информацией о названии шрифта, размере шрифта, цвете, фоне, выравнивании и т. д.<br>
Другими словами, нет необходимости применять форматирование к каждому слайду, как в программах типа PowerPoint.<br>
Просто выберите текст для отображения, и он будет отображаться с форматированием, макетом и фоном в соответствии с заданной темой.<br>

<hr />

<h3>Тексты Песен</h3>
<ul>
  <li>Добавление текстов песен в офлайн-репертуар программы.</li>
  <li>Поиск по названию и по содержимому песни.</li>
  <li>Объединение песен в группы.</li>
  <li>Определение описаний слайдов песен (куплет, припев, бридж и т. д.) (<a href='/tips/slide_label.html' target='_blank'>Подробнее</a>).</li>
  <li>Сохранение истории отображения текстов песен в проекции для анализа статистики.</li>
  <li>Назначение темы по умолчанию для песен (главное окно или окно редактирования текста).</li>
  <li>Назначение каждому слайду песни отдельных тем или фонов (окно редактирования текста).</li>
  <li>Определение порядка слайдов без необходимости редактировать или дублировать текст песни (главное окно, изменить порядок).</li>
  <li>Добавление комментариев к текстам песен, которые будут отображаться только на мониторе сцены.</li>
  <li>Отображение информации об авторских правах на проекционном экране.</li>
  <li>Кнопка «Корректор» для форматирования текста в соответствии со стандартом, используемым в церквях.<br> Удаляет запятые, точки, пробелы в начале и конце каждой строки, корректирует неправильную пунктуацию и т. д.</li>
  <li>Импортирование текстов песен из других источников.</li>
  <li>Проверка орфографии (доступна для некоторых языков).</li>
  <li>Презентации на нескольких языках одновременно (<a href='/tips/multiple_languages.html' target='_blank'>Подробнее</a>).</li>
  <li>Дополнительная информация о песне: тональность, удары в минуту (BPM), темп, ссылки на потоковые платформы и т. д.</li>
</ul>

<hr />

<h3>Святая Библия</h3>
<ul>
  <li>Отображение библейских стихов.</li>
  <li>Доступно несколько переводов благодаря партнерству с библейскими издателями, а также благодаря общедоступным переводам.</li>
  <li>Быстрый выбор и отображение стиха с помощью ввода его ссылки на клавиатуре.</li>
  <li>Поиск стиха по ключевым словам (CTRL+F).</li>
  <li>Отображение произвольной последовательности стихов.</li>
  <li>Запуск автоматической презентации группы стихов.</li>
  <li>Отображение нескольких стихов одновременно.</li>
  <li>Возможность разделить длинные стихи для отображения на нескольких слайдах.</li>
  <li>Отображение только ссылки на стих, без текста.</li>
  <li>Создание ярлыков для конкретного перевода Библии, например, связывая имя человека с переводом.</li>
  <li>Кнопка для сравнения версий и отображения текущего стиха в различных доступных переводах Библии.</li>
  <li>Отображение до трех разных версий Библии одновременно.</li>
  <li>Выбор разных версий Библии для разных экранов.</li>
  <li>Сопоставление стихов при отображении переводов с разных языков.<br> Так, при отображении Псалма 23 на английском языке будет отображаться Псалом 22 на русском.</li>
  <li>Альтернативное чтение — возможность начать презентацию стихов с описанием «церковь/лидер» для альтернативного чтения.</li>
  <li>Выбор расположения ссылки на стих и ее форматирование.</li>
  <li>Временное выделение части текста стиха подчеркиванием, курсивом, размером, цветом и т. п. (щелкните стих правой кнопкой мыши - выделить).<br> Форматирование сбрасывается кнопкой или автоматически после перезапуска Holyrics.</li>
  <li>Отображение версии Библии в проекции в полном или сокращенном виде, или с учетом авторских прав, индивидуально для каждой версии Библии.<br> Некоторые правообладатели требуют отображения полного названия перевода и/или информации об авторских правах, при этом в проекции не допускается отображать только аббревиатуру версии.<br> Это зависит не от программы Holyrics.</li>
</ul>

<hr />

<h3>Произвольный Текст</h3>
<ul>
  <li>Добавление любых текстов в офлайн-репертуар программы.</li>
  <li>Поиск по названию или отрывку текста.</li>
  <li>Организация текстов по подпапкам.</li>
  <li>Сохранение темы по умолчанию для текстовых презентаций (главное окно или окно редактирования текста).</li>
  <li>Применение определенных темы или фонов к отдельному слайду текстовой презентации (окно редактирования текста).</li>
  <li>Добавление комментариев к тексту презентации, которые будут отображаться только на экране сцены.</li>
  <li>Автоматическое разбиение длинных текстов на слайды (щелчок правой кнопкой мыши в текстовом поле в окне редактирования).</li>
  <li>Кнопка «Корректор» для форматирования текста в соответствии с предпочтительным стандартом.<br> Удаляет точки, запятые, пробелы в начале и конце каждой строки, корректирует неправильную пунктуацию и т. д.</li>
  <li>Проверка орфографии (доступна для некоторых языков).</li>
  <li>Презентации на нескольких языках одновременно (<a href='/tips/multiple_languages.html' target='_blank'>Подробнее</a>).</li>
</ul>

<hr />

<h3>Темы</h3>
Для отображения форматированного контента в проекции программа использует темы.<br> Можно создать несколько тем для использования в различных функциях программы и легко переключаться между ними одним щелчком мыши.<br>
<br>
Доступные настройки тем:<br>
<ul>
  <li>Фон: сплошной цвет, изображение, видео, прозрачный.</li>
  <li>Шрифт: размер, цвет, контур, яркость, тень, жирный шрифт, курсив.</li>
  <li>Поля, вертикальное и горизонтальное выравнивание, расстояние между строками и символами.</li>
  <li>Цвет фона и контур применительно к каждой строке.</li>
  <li>Текстуры можно использовать в качестве цвета для шрифта и фона 
    (<a href='/tips/color_texture.html' target='_blank'>Подробнее</a>):<br>
    • Сплошной цвет.<br>
    • Градиент.<br>
    • Изображение.<br>
    • Прозрачный: видны только контур и тень шрифта.</li>
  <li>Комментарий: настройки форматирования комментариев.</li>
  <li>Различные настройки: отображение текста заглавными буквами, установка автоматического переноса строк.</li>
  <li>Упорядочивание тем по тегам, например: синий, вода, круг и т. д.</li>
</ul>
<b>Примечание:</b><br>
По умолчанию, видео, используемые в качестве фона, воспроизводятся только на общедоступном экране из соображений производительности.<br>
На других экранах системы вместо фонового видео будет использоваться статическое изображение.<br>
В меню «Файл», Настройки, вкладка «Дополнительно» можно установить дополнительный экран для отображения видео в качестве фона.

<hr />

<h3>Изображения, аудио, видео и файлы</h3>

Программа Holyrics интегрирована с программой VLC Player для воспроизведения аудио и видео.<br>

<ul>
  <li>Библиотека аудио, видео и изображений в главном окне программы для организации файлов.</li>
  <li>Поиск файлов в папке (и подпапках, в зависимости от конфигурации).</li>
  <li>Отображение папки как списка воспроизведения. Когда вы создаете подпапку и добавляете в нее файлы, она становится списком воспроизведения медиафайлов в этой подпапке.</li>
  <li>Автоматическое отображение изображений (правая кнопка мыши на подпапке).</li>
  <li>Поддержка перетаскивания файлов.</li>
  <li>Ярлыки для отображения файлов из других папок на вашем компьютере.</li>
  <li>Настройка размера отображения видео и изображений: заполнить, подогнать...</li>
  <li>Создание видео из последовательности изображений (щелкните правой кнопкой мыши подпапку с изображениями).</li>
  <li>Применение к изображению эффектов (яркость, контрастность, оттенок и т. д.).</li>
  <li>Отображение изображения с эффектом размытия, когда изображение выходит за пределы проекционного экрана.</li>
  <li>Отображение разных изображений (например, разного разрешения) на разных экранах (<a href='/tips/image_multiple_screens.html' target='_blank'>Подробнее</a>).</li>
  <li>Редактирование медиа (щелкните правой кнопкой мыши по медиа - редактировать):<br>
    • Аудио – назначение начала и конца воспроизведения.<br>
    • Видео - назначение начала и конца воспроизведения, изменение разрешения и битрейта, извлечение аудио.<br>
    • Изображение – обрезка, изменение размера.</li>
  <li>Возможность переименовать файл непосредственно из Holyrics (правая кнопка мыши).<br> При этом, ссылки на файлы, используемые в функциях программы (например, панель закладок) корректно обновляются, тогда как при переименовании через файловый менеджер операционной системы эти ссылки перестают работать.</li>
  <li>На вкладке «Файлы» вы можете добавлять и упорядочивать файлы любого типа, но файлы, как правило, будут открываться самой операционной системой.<br> Программа Holyrics может запускать файлы .ppt .pptx из этой папки, но это доступно только для Windows, и для этого необходимо установить программу PowerPoint.</li>
</ul>

<h3>Проигрыватель VLC</h3>
<ul>
  <li>Отображение одного файла или списка файлов.</li>
  <li>Повторное воспроизведение одного файла или всего списка воспроизведения.</li>
  <li>Случайное воспроизведение через «перемешивание» списка воспроизведения.</li>
  <li>Отображение видео на нескольких экранах.</li>
  <li>Трансляция изображения с веб-камеры.</li>
  <li>Расширенные настройки: поля, постепенное появление/затухание и т. д.</li>
  <li>Нажатие на «таймер» плеера переключает значение между отображением прошедшего и оставшегося времени воспроизведения.</li>
</ul>

<hr />

<h3>Служения и мероприятия</h3>
<ul>
  <li>Регистрация в системе регулярных служений и мероприятий.</li>
  <li>Регистрация разовых мероприятий с указанием их даты и времени.</li>
  <li>Для зарегистрированных служений автоматически создаются плейлисты.<br> В каждый из них заранее можно добавить песни, тексты или медиафайлы.</li>
  <li>Настройка <a href='#wallpaper'>обоев</a> для служения (файл меню, настройки, обои).<br> Настройка <a href='#wallpaper'>обоев</a> для мероприятия (окно редактирования мероприятия).<br> Таким образом, в проекции всегда будут автоматически использоваться <a href='#wallpaper'>обои</a>, заранее определенные для соответствующего служения или мероприятия из списка воспроизведения, выбранного в главном окне программы.</li>
  <li>При регистрации служений с правилом «Все» есть возможность скрыть отдельные недели.<br> Например, если вы хотите зарегистрировать причастие на «Каждое первое воскресенье», и у вас есть служение, зарегистрированное на «Каждое воскресенье», то чтобы избежать дублирования плейлиста, нужно исключить «Первую неделю» для служения «Каждое воскресенье».</li>
</ul>

<hr />

<h3>Плейлист</h3>
Все служения, регулярные и уникальные мероприятия, зарегистрированные в системе, формируют независимый плейлист, что позволяет заранее организовать плейлист для каждого служения и мероприятия, а также хранить историю всех ранее созданных.
<ul>
  <li>Плейлист Песни.<br>
Добавление текстов песен, которые будут использоваться в соответствующем служении или мероприятии.<br>
Можно выбрать несколько элементов для последовательного отображения.<br>
Опция в настройках для автоматического сохранения истории (отметить как прослушанную) при просмотре текстов песен и их включения в список воспроизведения.</li>
  <li>Плейлист Медиа (также поддерживает тексты песен).<br>
Медиа в данном случае — это общий термин, он не означает просто аудио, видео и изображение.<br>
Медиа-плейлист – это место для добавления и систематизации всех элементов, которые будут воспроизводиться на соответствующей служении или мероприятии.<br>
Тексты песен, библейские стихи, текст, аудио, видео, изображения, объявления, автоматическое представление, обратный отсчет и т. д.<br>
Возможность организовать список с помощью заголовков, которые могут скрывать или расширять подэлементы, добавленные под соответствующим заголовком (<a href='/tips/playlist_title.html' target='_blank'>Подробнее</a>).<br>
Установка продолжительности для каждого элемента списка.<br>
Отображение вероятного времени выполнения элемента (время расписания) от начала служения/мероприятия и продолжительности каждого предыдущего элемента в списке (временная шкала).</li>
  <li>Делитесь в Интернете списком текстов песен, к которому можно получить доступ через браузер, а также загрузить на другой компьютер.</li>
  <li>Сохранение плейлиста в файл для открытия на другом компьютере.</li>
  <li>Сохранять шаблоны списков мультимедиа для повторного использования в других служениях и мероприятиях.</li>
</ul>

<hr />
<h3>Мобильное приложение</h3>
Вы можете управлять программой Holyrics через мобильное приложение Holyrics.<br>
<ul>
  <li>
Основные функции доступны для управления в приложении.<br>
Тексты песен, стихи из Библии, медиа, медиаплеер и т. д.</li>
  <li>
Обновите данные приложения с помощью данных компьютера.<br>
Вы можете скачать список песен, плейлист, историю и т. д. в мобильное приложение для просмотра контента в любое время, а не только при подключении к программе.<br>
Члены служения прославления могут получить доступ к музыкальному репертуару на своем мобильном телефоне, что упрощает поиск и создание плейлиста для предстоящих служений.</li>
  <li>
Отправляйте файлы с телефона на компьютер (версия 2024-04 доступна только для Android).</li>
</ul>

<hr />
<h3>Настройки отображения</h3>
Независимые настройки для каждого экрана системы.
<ul>
  <li>Изменение полей экрана (размер).</li>
  <li>Отображение дополнительной информации, такой как счетчик слайдов, описание слайда, название песни, авторские права и т. д.</li>
  <li>Настройка экрана в качестве монитора сцены.</li>
  <li>
Выбор версии Библии, отображаемой на соответствующем экране.<br>
Это позволяет отображать разные версии Библии на разных экранах.</li>
  <li>Изменение <a href='#multiple_language'>перевода</a>, отображаемого на соответствующем экране.</li>
</ul>

<hr />

<h3>Монитор сцены</h3>
Возможность использовать дополнительные мониторы в операционной системе (или браузере через http) для отображения эксклюзивного контента с форматированием, отличным от контента, отображаемого на главном экране.
<ul>
  <li>Изменение темы/форматирования/макета, используемых для отображения контента на мониторе сцены.</li>
  <li>Отображение части следующего куплета/припева песни на мониторе сцены.</li>
  <li>Различное форматирование для текущего содержимого и содержимого предстоящих слайдов.</li>
  <li>Отображение комментариев к отображаемому контенту.</li>
  <li>Отображение содержимого <a href='#communication_panel'>панели связи</a>.</li>
  <li>Отображение следующего изображения при отображении списка изображений.</li>
  <li>Выбор типа контента, отображаемого для вывода через http.</li>
</ul>

<hr />

<h3>Интерфейс программы – главное окно</h3>
<ul>
  <li>
<b>Левая часть:</b> данные библиотеки/пользователя.<br>
Текст песни, аудио, видео, изображение, файл и т. д.<br>
<i>Окно отображения оповещений слева внизу</i>.</li>
  <li>
<b>Центральная левая часть:</b> список абзацев/слайдов текста песни или выделенного текста.</li>
  <li>
<b>Центральная правая часть:</b> VLC Player и предварительный просмотр абзаца/слайда, выбранного в списке, а также слайдов, отображаемых на экране проецирования или сцены.</li>
  <li>
<b>Правая часть:</b> Список воспроизведения мероприятий и список тем оформления.<br>
Список тем может отображаться вертикально или горизонтально (под списком воспроизведения).</li>
  <li><b>Внизу (во время презентации):</b> <a href='#presentation_footer'>Нижний колонтитул презентации</a>.</li>
  <li><b>Встроенный чат:</b> возможность закрепить чат Holyrics в одной из областей главного окна (меню окна, встроенный чат).</li>
  <li>Интерфейс программы в светлом или темном режиме (меню окна, цвет интерфейса).</li>
</ul>

<hr />
<h3 id='presentation_footer'>Нижний колонтитул презентации</h3>
<ul>
  <li>В нижнем колонтитуле презентации может отображаться только текст слайдов или слайд в формате изображения (предварительный просмотр).</li>
  <li>В нижнем колонтитуле можно отображать до 4 строк контента для одновременного просмотра нескольких слайдов.</li>
  <li>Кнопка +/- для изменения шрифта или размера изображения слайда нижнего колонтитула презентации.</li>
  <li>Просмотр описания слайда (припев, куплет и т. д.) и индекса каждого слайда.</li>
  <li>
Функционал «Перейти». Текстовое поле в левом углу нижнего колонтитула презентации.<br>
Позволяет ввести число для перехода к слайду с этим номером или сочетание клавиш, например букву <b>C</b>, для перехода к слайду <b>Припев</b>.<br>
Сочетание клавиш можно настроить в <b>Настройки отображения, общий экран, описание слайда</b>.</li>
  <li>
Меняйте тему или фон презентации в реальном времени.<br>
В левом нижнем углу нижнего колонтитула презентации находится кнопка темы, переключающая отображение списка тем и фонов, доступных для изменения в режиме реального времени.<br>
Это можно изменить двойным щелчком мыши по теме/фону (изменяются все слайды в презентации) или перетаскиванием на определенный слайд в нижнем колонтитуле презентации.</li>
  <li>Редактировать текст на слайде в режиме реального времени (щелкните слайд правой кнопкой мыши).</li>
  <li>При зажатой клавише CTRL, стрелки влево/вправо меняют слайд в проекции только при отпускании клавиши CTRL.</li>
</ul>

<hr />
<h3 id='communication_panel'>Панель связи</h3>
Панель отображения эксклюзивного контента для монитора сцены
<ul>
  <li>Отображение текста во весь экран.</li>
  <li>Отображение оповещений в нижней или верхней части экрана.</li>
  <li>Отображение текущего времени на весь экран или в оповещении.</li>
  <li>Отображение обратного отсчета или таймера.</li>
  <li>Настройка сохранения текста оповещений на экране сцены при скрытии текста презентации из проекции (F8, F9, F10...).</li>
  <li>Кнопка «привлечь внимание», мигающая на экране (несовместимо для вывода через http).</li>
  <li>Сохранение сообщения, готового к отображению.</li>
  <li>Возможность постоянно отображать текст оповещения поверх всего или только тогда, когда на дисплее нет презентации.</li>
  <li>Возможность отображать обратный отсчет в полноэкранном режиме, когда презентация не запущена, и автоматически отображать его в оповещении во время презентации.</li>
  <li>
Чат для внутреннего общения, возможность общаться с другими участниками через мобильное приложение Holyrics.<br>
Внутренний чат Holyrics можно синхронизировать с группой Telegram (<a href='#telegram_features'>Подробнее</a>).</li>
  <li>Вкладка «Настройки» для форматирования определенного контента, например определения различных цветов обратного отсчета, когда он близок к завершению, когда он отрицательный и т. д.</li>
  <li>Отображение оставшегося времени работы мультимедиа в программном проигрывателе.</li>
</ul>

<hr />
<h3 id='plugin_holyrics'>Плагин Holyrics</h3>
Промежуточный коммуникационный интерфейс, который позволяет HTTP-серверу получать доступ к контенту, отображаемому в проекции, и передавать через HTTP для просмотра в браузерах или добавления в качестве источника в эфирные программы.

<hr />
<h3>Викторина (множественный выбор)</h3>
(меню инструменты)<br />
Функциональность для создания презентаций вопросов и ответов с множественным выбором.<br />
<ul>
  <li>Создание вопросов с несколькими вариантами ответов.</li>
  <li>Отображение вопросов последовательно или в случайном порядке.</li>
  <li>Отображение обратного отсчета до окончания возможности ответа.</li>
  <li>Параметры, позволяющие отображать каждый из вариантов ответа на отдельном слайде.</li>
  <li>Различные настройки оформления (шрифт, цвет, фон и т. д.).</li>
  <li>
Настройка аудио для воспроизведения на каждом этапе презентации.<br />
В начале презентации (вопрос и варианты), во время обратного отсчета, правильных и неправильных ответов.<br />
Для шага «начало презентации» можно настроить разные звуки.<br />
Например, начиная с четвертого вопроса воспроизводится другой звук, начиная с восьмого вопроса — другой звук и т. д.</li>
  <li>Возможность управления <a href='#scoreboard'>табло</a> с результатами каждой команды.</li>
</ul>

<hr />
<h3 id='scoreboard'>Табло</h3>
(окно викторина или меню инструменты, еще)<br />
Создавайте группы (команды) и управляйте счетом каждой группы для отображения на экране.

<hr />
<h3>Лотерея</h3>
(меню инструменты)<br />
Создание розыгрышей из последовательности чисел или списка имен/предметов.<br />
<ul>
  <li>Различные настройки оформления (скорость, длительность, шрифт, цвет, фон и т. д.).</li>
  <li>Установка воспроизведения звука во время процесса выбора и при отображении выбранного элемента.</li>
  <li>Выбор нескольких элементов одновременно.</li>
</ul>

<hr />
<h3 id='telegram_features'>Функции, интегрированные с Telegram</h3>
<ul>
  <li>
<b>Вопросы:</b> Создание сеанса вопросов, где люди могут отправлять вопросы боту Telegram, и эти вопросы будут доступны в окне Holyrics, что позволит легко управлять ими и отображать их в проекции (меню инструменты, еще).</li>
  <li>
<b>Опрос:</b> Создание опроса, в котором люди смогут голосовать за чат-бота, и результат будет отображаться на проекции (меню инструменты, еще).</li>
  <li>
<b>Лотерея:</b> Создайте розыгрыш, где люди могут зарегистрироваться для участия в розыгрыше в чат-боте, и список участников будет автоматически доступен в окне розыгрыша программы (меню инструменты).</li>
  <li>
<b>Чат:</b> синхронизируйте группу Telegram с внутренним чатом Holyrics, чтобы сообщения, полученные в группе Telegram, можно было просматривать в собственном окне чата Holyrics, а сообщения, отправленные пользователями, в собственном чате Holyrics (через компьютер или мобильное приложение) также можно посмотреть в группе Telegram (меню окна, chat).</li>
  <li>
<b>Файл:</b> Все файлы, отправленные персонализированному чат-боту, зарегистрированному в учетной записи пользователя Holyrics, будут перечислены и организованы в окне программы (меню инструменты, еще).<br>
Упрощение отправки файлов в программу: каждый может отправить файл чат-боту и получить к нему доступ непосредственно из интерфейса Holyrics.<br>
Ограничение в 20 МБ для отправки файла непосредственно в чат, но для файлов большего размера можно отправить в чат ссылку на Google Диск.</li>
</ul>

<hr />
<h3>Панель закладок</h3>
Панель избранного, расположенная в верхней части главного окна или окна Библии, позволяет добавлять различные типы исполняемых элементов программы, такие как видео, изображения, объявления и т. д.<br>
Это место для добавления часто используемых элементов для быстрого доступа.<br>
Вы можете распределять элементы по папкам и подпапкам.<br>

<hr />
<h3>Имитация проекции</h3>
Возможность для имитации дополнительных экранов, подключенных к системе.<br>
Это удобно в ситуации, когда вы готовитесь к служению дома и у вас нет подключенного второго экрана, но вы хотите работать с программой так, как если бы вы были в церкви, где второй экран есть.<br>
Возможно добавить еще один монитор сцены, чтобы задействовать имитацию экрана сцены.<br>
Полезно для изучения возможностей программы.

<hr />
<h3>Облачная синхронизация — GoogleDrive™</h3>
Программа позволяет синхронизировать облачные данные между разными компьютерами, синхронизируя все данные программы и медиафайлы (кроме локальных настроек).<br>
Таким образом, вы можете создавать новые тексты песен, презентации, добавлять медиафайлы, создавать списки воспроизведения и т. д. на своем домашнем компьютере и вся программа будет добавлена на церковном компьютере.<br>
И, конечно же, наоборот: все, что делается на церковном компьютере, будет доступно на вашем домашнем компьютере.<br>

<hr />
<h3>Резервное копирование в облаке – GoogleDrive™</h3>
Программа позволяет выполнять резервное копирование данных в облаке.<br>
Таким образом, данные и настройки программы сохраняются на Диске, что позволяет при необходимости восстановить данные.<br>
В отличие от облачной синхронизации, резервное копирование позволяет подключить только один компьютер для каждого пользователя Google.<br>

<hr />
<h3>Расписание</h3>
Наряду с регистрацией служений и мероприятий в программе Holyrics можно регистрировать команды, роли и участников, что позволяет создавать расписания служений и мероприятий.<br>
Основное внимание в программе уделяется не администрированию и организации команд, программа предоставляет только базовые функции администрирования и создания расписания.<br>
<b>Создание списков на основе участников:</b> сетка, в которой каждый столбец представляет собой служение или мероприятие, каждая строка — это член, а каждая ячейка — поле, позволяющее определить, запланирован ли участник на участие в соответствующем служении/мероприятии.<br>
В этом типе расписания невозможно определить, какую роль будет выполнять участник.<br>
<b>Создавайте списки на основе ролей:</b> сетка, в которой каждый столбец — это служение или мероприятие, каждая строка — это роль, а каждая ячейка — список участников, которым можно назначить ту или иную роль.<br>

<hr />
<h3>Объявления</h3>
Создание текстовых объявлений с использованием фонового изображения.<br>
Позволяет управлять анонсами событий, любыми информационными сообщениями или рекламой, которая может отображаться во время служений и мероприятий.<br>
Запуск автоматического показа нескольких объявлений, меняющихся на экране каждые X секунд.<br>

<hr />
<h3>Автоматический показ</h3>
(меню инструменты)<br />
Возможность создать автоматическую презентацию текста песни, задав длительность каждого слайда, в соответствии с выбранным музыкальным сопровождением в формате MP3.<br>
При запуске такой презентации слайды с текстами песен будут воспроизводиться одновременно со звуком и переключаться автоматически.<br>

<hr />
<h3>Персонализированное сообщение</h3>
Функционал для создания предварительно отформатированных сообщений для более практичного и организованного отображения многоразового текстового сообщения.<br>
Например: <i>{имя</i>, пожалуйста, зайдите в <i>{location}</i>.<br>
Где <i>{имя</i> и <i>{местоположение</i> — это поля, которые будут заполнены пользователем без необходимости записывать весь контент.<br>
Сообщение может отображаться на общем экране или на мониторе сцены, и его можно отображать в полноэкранном режиме или в виде оповещения.<br>

<hr />
<h3>Журнал</h3>
В программе можно создавать и просматривать отчеты об использовании.<br>
<ul>
  <li>
<b>Воспроизведенные песни:</b> отчет со списком текстов песен, наиболее часто отображаемых в проекции.<br>
Пользователь должен установить метку «воспроизведенной песни» при отображении музыки в проекции или включить автоматическую пометку в настройках списка воспроизведения.</li>
  <li>
<b>Расписание:</b> список, в котором указано, сколько раз был запланирован каждый участник или песня.</li>
  <li>
<b>Журнал активности:</b> отчет обо всех презентациях, сделанных в программе (тексты песен, медиа и т. д.).<br>
Необходимо активировать ведение журнала в настройках.</li>
</ul>

<hr />
<h3>Оповещение</h3>
(левый нижний угол главного окна)<br />
Отображает предупреждающее сообщение в нижнем колонтитуле или вверху экрана, не нарушая и не удаляя текущую презентацию.<br>
Можно настроить относительную высоту оповещения на экране, цвет, шрифт и т. д.<br>
Сообщения, текст которых не умещается на экране, автоматически отображаются как «бегущая» строка.<br>

<hr />
<h3>Обратный отсчет</h3>
(меню инструменты)<br />
Возможность запустить обратный отсчет в проекции, чтобы указать время, оставшееся до начала служения или мероприятия.<br>
Настраиваемый текст, который будет отображаться рядом с обратным отсчетом.<br>
Установка действия по умолчанию, которое будет автоматически выполняться по окончании обратного отсчета.<br>

<hr />
<h3 id='wallpaper'>Обои</h3>
(меню файлов, настройки, обои).<br>
Установите обои, которые будут отображаться по умолчанию на проекционном экране, когда презентация не отображается.<br>
Установите разные изображения обоев для разных служений и мероприятий.<br>
Отображение часов вместе с обоями.<br>

<hr />
<h3>Логотип Лео</h3>
(меню инструменты).<br>
Настройте анимированное изображение или GIF-изображение, чтобы оно всегда отображалось в углу проекционного экрана, даже во время презентации.<br>
Настройки так, чтобы изображение, определенное как логотип, располагалось по центру экрана при отсутствии презентации и отображалось в углу при ее наличии.<br>

<hr />
<h3>Эффект перехода</h3>
(настройки дисплея).<br>
Различные параметры и настройки эффектов перехода между текстом и изображениями.<br>
<b>Примечание:</b><br />
 - По умолчанию эффекты перехода выполняются только на общедоступном экране из соображений производительности.<br>
В меню файлов, настройках, вкладке «Дополнительно» можно определить дополнительный экран для выполнения эффектов перехода.<br />
 - При запуске или завершении презентации эффект постепенного появления/затухания окна презентации настраивается в меню «Файл», настройках, вкладке «Общие».<br>

<hr />
<h3>Запланированные задачи</h3>
(меню инструменты)<br />
Запланируйте запуск элемента в определенные дни недели и время.<br>
Товар будет выполнен в указанный день и время.<br>
Для некоторых запланированных элементов, например видео, можно определить дополнительные настройки, указав громкость, которая будет установлена ​​в плеере при воспроизведении видео.<br>
За 1 минуту до времени выполнения элемента в углу экрана отображается уведомление о том, что элемент скоро будет выполнен, с кнопкой отмены действия при необходимости.<br>
Примечание. Это внутренняя функция программы, она работает только в том случае, если программа открыта.<br>
Вы также можете запланировать запуск задачи один раз в определенное время, щелкнув элемент правой кнопкой мыши.<br>
Например, щелкнув правой кнопкой мыши изображение и запланировав запуск задачи в определенное время.<br />

<hr />
<h3>Расширенный редактор</h3>
(окно редактирования, 3 точки)<br />
Расширенное окно редактирования текстов песен и текстового представления.<br>
Позволяет вносить расширенные изменения в слайд, применяя определенное форматирование к словам или отрывкам на слайде.<br>
Шрифт, размер, жирный шрифт, курсив, подчеркивание и т. д.<br>
Вы можете сохранить стиль форматирования <code>(style)</code>, чтобы быстро применить его к выбранному разделу.<br />
Например, создайте <code>(style)</code>, который применяет форматирование желтым цветом, подчеркиванием и курсивом.<br />
Щелкните раздел правой кнопкой мыши, выберите сохраненное форматирование, которое хотите применить, в подменю «стиль» или создайте новое форматирование<br />

<hr />
<h3>MIDI</h3>
(меню инструменты)<br />
MIDI — это протокол связи между электронными музыкальными инструментами и другими электронными устройствами (например, компьютером или другим инструментом).<br>
Функциональность MIDI в программе позволяет выполнять действия в программе с использованием этого протокола.<br>
Например, вы можете автоматически управлять слайд-шоу в зависимости от темпа музыки.<br>
(<a href='/tips/midi.html' target='_blank'>Подробнее</a>).<br>

<hr />
<h3>JavaScript (ECMA 5.1)</h3>
Некоторые функции программы позволяют использовать JavaScript для реализации более сложных и точных решений.<br>
Это позволяет программе выполнять задачи, выходящие за рамки изначально настроенных, в зависимости только от индивидуальной реализации пользователя с использованием кодов, написанных на JavaScript.<br>
<a href='/go.php?action=jslib_doc' target='_blank'>Документация</a>.<br>
Некоторые ресурсы, использующие JavaScript.<br>
<ul>
  <li>
<b>Включить:</b> область, позволяющая пользователю создать собственную библиотеку кода с многоразовыми методами в любом ресурсе, использующем JavaScript в программе.<br>.</li>
  <li>
<b>Запуск:</b> выполнение кода JavaScript при запуске программы.<br>.</li>
  <li>
<b>Системные переменные.</b> Создайте методы JavaScript, возвращающие определенное значение, которое можно использовать в тексте презентации или оповещения.<br>
Например, создайте метод под названием "abc" <code>function abc() {...</code> и в тексте, отображаемом в проекции, используйте <code>Test @js{abc} test</code>< бр>
код <code>@js{abc}</code> будет заменен в реальном времени в проекции содержимым, возвращаемым в <code>функции abc() {...</code>.<br>
(<a href='/tips/system_var_js.html' target='_blank'>Подробнее</a>).</li>
  <li>
<b>JSCommunity:</b> В программе доступен репозиторий многократно используемых кодов (<a href='/go.php?action=community_doc' target='_blank'>Подробнее</a>).</li>
  <li>
<b>Скрипт:</b> создайте элемент «Скрипт», выполняющий код JavaScript (<a href='/tips/holyrics_script.html' target='_blank'>Подробнее</a>).</li>
  <li>
<b>API-сервер</b>. Создавайте собственные действия (маршруты) для ресурса <a href='#api_server'>API-сервер</a>, что позволяет при необходимости возвращать определенные ответы в дополнение к стандартным действиям. доступен в официальной документации.</li>
  <li>
<b>Триггеры.</b> Выполнение кода JavaScript как действие <a href='#trigger'>триггера</a>.</li>
  <li>
<b>Контекстное действие:</b> • Создание сценариев, которые (щелкнув правой кнопкой мыши по элементу программы) будут получать соответствующий элемент в качестве параметра для выполнения специального действия;</a>.</li>
</ul>
Как правило, исполняемые элементы программы (тексты, медиа и т. д.) отображают параметр <b>Информация о сценарии</b> при нажатии правой кнопки мыши.<br />
Эта опция отображает информацию об элементе, такую ​​как идентификатор элемента и готовый к выполнению пример кода JavaScript для элемента.<br />

<hr />
<h3>API</h3>
(меню инструменты, еще).<br>
Вы можете создавать элементы для добавления на панель избранного или в список воспроизведения, которые выполняют HTTP-запросы, отправляют MIDI-коды на другие устройства или выполняют код JavaScript.<br>
Это позволяет вам выполнять действия в других программах и устройствах, таких как OBS Studio, программа освещения, PTZ-камеры и т. д., или выполнять сценарии, которые взаимодействуют с программой, имея возможность выполнять действия или список действий в программном и точном виде. путь.<br>
Например, вы можете создать элемент, который при выполнении меняет сцену в вашей программе трансляции, или элемент, который выбирает предустановку с PTZ-камеры в сети и т. д.<br>
(<a href='/tips/api_item.html' target='_blank'>Подробнее</a>).<br>

<hr />
<h3 id='trigger'>Триггеры</h3>
(меню инструменты, еще).<br>
Выполнять действия автоматически, когда что-то происходит в программе.<br>
Например, исполнение чего-либо всякий раз, когда на проекции отображаются тексты песен.<br>
Он позволяет автоматизировать повторяющиеся задачи и интегрировать различные мультимедийные сектора и инструменты.<br>
Например, автоматическая смена сцен в эфирной программе, изменение освещения и т. д.<br>

<hr />
<h3 id='api_server'>API-сервер</h3>
(меню «Файл», настройки, API-сервер).<br>
Коммуникационный API для выполнения действий и доступа к данным из программы Holyrics по протоколу HTTP.<br>
(<a href='/go.php?action=api_server_doc' target='_blank'>Документация</a>).<br>

<hr />
<h3>Горячие клавиши</h3>
(меню помощи).<br>
Редактируемые сочетания клавиш для функций программы.<br>

<hr />
<h3>Быстрая презентация стихов</h3>
При отображении текстового элемента или файла .pptx, если в тексте слайда есть библейская ссылка, стих можно отобразить быстро, не завершая текущую презентацию.<br>
(<a href='/tips/quick_verse_presentation.html' target='_blank'>Подробнее</a>).<br>

<hr />
<h3>Фильтр тем по умолчанию</h3>
(тематическое меню)<br />
Тему можно легко повторно использовать в любой программной среде, но во многих ситуациях тема, созданная пользователем, имеет определенное применение в функциональности программы.<br>
Для облегчения организации можно определить фильтр по умолчанию, чтобы в списке тем различных функций программы отображались только те элементы, которые вы определяете для этих функций.<br>
(<a href='/tips/default_themes_filter.html' target='_blank'>Подробнее</a>).<br>

<hr />
<h3>Системные переменные</h3>
(меню инструменты, еще).<br>
Используйте коды в тексте, отображаемом в проекции, где код будет заменен на определенное значение в реальном времени.<br>
Например, используя код @hour_minute, в проекции этот код будет преобразован в текущие час и минуту системы.

<hr />
<h3>Синхронизация BPM</h3>
Во многих случаях фоновые видео, используемые при проецировании, слишком быстры для более медленной музыки, а другие видео слишком медленны для более быстрой музыки.<br>
В программе можно включить автоматическую синхронизацию, чтобы скорость воспроизведения фонового видео при отображении текста песни соответствовала скорости самой песни.<br>
(<a href='/tips/bpm_sync.html' target='_blank'>Подробнее</a>).<br>

<hr />
<h3>Среда выполнения</h3>
Опция «Среда выполнения» служит для облегчения управления некоторыми другими функциями программы при активации опции «облачной синхронизации» на нескольких компьютерах.
(<a href='/tips/runtime_environment.html' target='_blank'>Подробнее</a>).<br>

<hr />
<h3>Отображение веб-сайта/страницы в полноэкранном режиме</h3>
Чтобы открыть веб-сайт/страницу в полноэкранном режиме на проекционном экране<br />
(<a href='/tips/fullscreen_website.html' target='_blank'>Подробнее</a>).<br>

<hr />
<h3>Мобильность</h3>
Программа портативна, ее можно переносить на другой жесткий диск и даже на внешние устройства.<br>
(<a href='/faq#q039' target='_blank'>Подробнее</a>).<br>

<hr />
<h3>[Описание слайда] Группировать похожие описания</h3>
В некоторых случаях слайды с текстами песен могут иметь разные описания, но означать одно и то же.<br>
Например: хор и хор.<br>
Чтобы гарантировать, что описание припева всегда идентифицируется программой как описание припева:<br>
- Доступ к настройкам описания слайдов (настройки отображения);<br>
- Нажмите на 3 точки в описании хора;<br>
– Выберите псевдонимы > добавьте и добавьте название припева.<br>

<hr />
<h3>Тема/фон (автоматизация)</h3>
(тематическое меню, автоматизация)<br />
Создавайте правила для динамического задания темы или фона слайдов презентации.<br />
Позволяет определить тему/фон в зависимости от текстового содержимого слайда, динамически создавая презентации.<br />
Например, если в тексте слайда есть слово «огонь», установите нужную тему/фон.<br />

<hr />
<h3>Оттенок — Фон</h3>
(меню Windows, строка меню, оттенок) <br />
Изменение оттенка фонового видео <br />
Например, видео с преобладанием зеленого цвета может отображаться как преимущественно синее непосредственно в проекции в динамическом режиме.<br />
Это облегчает повторное использование видео в разных цветах, а также обеспечивает лучшую интеграцию с окружающим освещением.<br />

<hr />
<h3>Заказать музыкальные слайды как сборник гимнов</h3>
Возможность автоматического добавления слайда припева/хора между каждым куплетом песни в презентации.<br />
Создать или отредактировать группу песен (меню редактирования, группу);<br />
Щелкните правой кнопкой мыши по нужной группе и активируйте настройку;<br />
Все песни в этой группе будут отображаться с добавлением припева или слайда припева поочередно с другими слайдами (куплетами) песни.<br />
Примечание. В тексте песни должно быть как минимум описание слайда «припев» или «припев», добавленное на правильный слайд, чтобы определить, какой слайд будет добавлен среди других слайдов (куплетов)<br />

<hr />
<h3>Настройки воспроизведения аудио/видео</h3>
Возможность настроить параметры воспроизведения аудио или видео в избранном или списке воспроизведения (щелкните правой кнопкой мыши по элементу).<br />
Например, установка определенной громкости, определенной минуты/секунды для запуска видео (и/или остановки) и т. д.<br />
